<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"8cfe2a2682dbfd722f860618f3f54b31d2de7601fab495d25f15cd3a5fc9d1bf","plan_job_ref":"Job PR Plan #37 at https://github.com/GradientFlow-ai/terraform/actions/runs/4584974588","plan_hash":"05207c0cf5c8ed5d5d8cc10c8726e253b3421806a6b636f4911680478725f0ed","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __.__<details open><summary>With variables</summary>

```hcl
TF_VAR_AWS_ACCESS_KEY_ID     = ""
TF_VAR_AWS_SECRET_ACCESS_KEY = ""
TF_VAR_VERCEL_API_TOKEN      = "hbk84kOG3lWDysRodIjnV3Mb"
```
</details>
<details>
<summary>Plan: 6 to add, 6 to change, 3 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.repos.github_branch_protection.eaas will be updated in-place
  ~ resource "github_branch_protection" "eaas" {
        id                              = "BPR_kwDOI7EyTc4CIwZR"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "MDQ6VXNlcjMxMTg5NjQ=",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }
    }

  # module.repos.github_branch_protection.embeddings_api will be updated in-place
  ~ resource "github_branch_protection" "embeddings_api" {
        id                              = "BPR_kwDOI-ZWE84CIwg4"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "MDQ6VXNlcjMxMTg5NjQ=",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }
    }

  # module.repos.github_branch_protection.fast-api-ocean will be updated in-place
  ~ resource "github_branch_protection" "fast-api-ocean" {
        id                              = "BPR_kwDOI96H_s4CIwg3"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "MDQ6VXNlcjMxMTg5NjQ=",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }
    }

  # module.repos.github_branch_protection.terraform will be created
  + resource "github_branch_protection" "terraform" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "*********"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "/coyotespike",
            ]
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Check file formatting",
              + "Create terraform plan",
              + "Validate terraform",
            ]
          + strict   = false
        }
    }

  # module.roles.aws_iam_user.gh_runner will be updated in-place
  ~ resource "aws_iam_user" "gh_runner" {
        id            = "gh_runner"
        name          = "gh_runner"
      ~ tags          = {
          - "AKIATA2OA5BNYFFDU5OJ" = "new access key" -> null
        }
      ~ tags_all      = {
          - "AKIATA2OA5BNYFFDU5OJ" = "new access key"
        } -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.s3.aws_s3_bucket.GradientFlowai-parquet-files will be created
  + resource "aws_s3_bucket" "GradientFlowai-parquet-files" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "gradientflow-parquet-files"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket.GradientFlowai-parquet-files2 will be destroyed
  # (because aws_s3_bucket.GradientFlowai-parquet-files2 is not in configuration)
  - resource "aws_s3_bucket" "GradientFlowai-parquet-files2" {
      - arn                         = "arn:aws:s3:::gradientflow-parquet-files" -> null
      - bucket                      = "gradientflow-parquet-files" -> null
      - bucket_domain_name          = "gradientflow-parquet-files.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "gradientflow-parquet-files.s3.us-west-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2F56UZL2M1ACD" -> null
      - id                          = "gradientflow-parquet-files" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-west-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - grant {
          - permissions = [
              - "READ",
            ] -> null
          - type        = "Group" -> null
          - uri         = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
        }
      - grant {
          - id          = "cdf04fefee8fe8b3f3ee29a6e6fae4e8712b32c3882435140df1a45bcc1e6dab" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.s3.aws_s3_bucket_acl.parquet-acl must be replaced
-/+ resource "aws_s3_bucket_acl" "parquet-acl" {
      ~ bucket = "gradientflow-parquet-files" # forces replacement -> (known after apply)
      ~ id     = "**************************************" -> (known after apply)
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "READ" -> null

              - grantee {
                  - type = "Group" -> null
                  - uri  = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name = "timothyroy" -> null
                  - id           = "cdf04fefee8fe8b3f3ee29a6e6fae4e8712b32c3882435140df1a45bcc1e6dab" -> null
                  - type         = "CanonicalUser" -> null
                }
            }
          - owner {
              - display_name = "timothyroy" -> null
              - id           = "cdf04fefee8fe8b3f3ee29a6e6fae4e8712b32c3882435140df1a45bcc1e6dab" -> null
            }
        }
    }

  # module.s3.aws_s3_bucket_cors_configuration.allow_cors will be created
  + resource "aws_s3_bucket_cors_configuration" "allow_cors" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "*",
              + "*gradient-flow-ai.vercel.app",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3000
        }
      + cors_rule {
          + allowed_headers = []
          + allowed_methods = [
              + "GET",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = []
        }
    }

  # module.s3.aws_s3_bucket_versioning.versioning_parquet_files must be replaced
-/+ resource "aws_s3_bucket_versioning" "versioning_parquet_files" {
      ~ bucket = "gradientflow-parquet-files" # forces replacement -> (known after apply)
      ~ id     = "**************************" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.vercel.vercel_project_environment_variable.aws_access_key_id will be updated in-place
  ~ resource "vercel_project_environment_variable" "aws_access_key_id" {
        id         = "yReP7AMiiIyX4535"
      - value      = (sensitive value) -> null
        # (4 unchanged attributes hidden)
    }

  # module.vercel.vercel_project_environment_variable.aws_secret_access_key will be updated in-place
  ~ resource "vercel_project_environment_variable" "aws_secret_access_key" {
        id         = "JoR94vjf6HUUFUgd"
      - value      = (sensitive value) -> null
        # (4 unchanged attributes hidden)
    }

  # module.vercel.vercel_project_environment_variable.test_key will be created
  + resource "vercel_project_environment_variable" "test_key" {
      + id         = (known after apply)
      + key        = "TEST_DUMMY_KEY"
      + project_id = "********************************"
      + target     = [
          + "production",
        ]
      + team_id    = (known after apply)
      + value      = (sensitive value)
    }

Plan: 6 to add, 6 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [PR Plan #37](https://github.com/GradientFlow-ai/terraform/actions/runs/4584974588)